# language: ru
Функционал: пользователь регистрируется на сайте

  Для дработы с сайтом(просмотры, комментарии и т.д.) нужна регистрация.
  Являясь гостем я захожу на сайт и регистрируюсь двумя способами
  
  Сценарий: регистрация через вконтакте
    Допустим я являюсь гостем
    Если я перехожу по ссылке "Регистрация через Вконтакте"
    То пользователь с именем "Дмитрий" и фамилией "Боровиков", ником "" и аккаунтом "vkontakte" должен быть создан
      
  Сценарий: анонимная регистрация
    Допустим я являюсь гостем
    Если я перехожу по ссылке "Анонимная регистрация"
    И ввожу в поле "nickname" значение "sour"
    И ввожу в поле "password" значение "123456"
    И ввожу в поле "password_confirmation" значение "123456"
    И нажимаю на кнопку "Регистрация"
    То пользователь с именем "" и фамилией "", ником "sour" и аккаунтом "identity" должен быть создан
