# language: ru
Функционал: пользователь регистрируется на сайте

  Для дработы с сайтом(просмотры, комментарии и т.д.) нужна регистрация.
  Являясь гостем я захожу на сайт и регистрируюсь двумя способами
  
  @signup-vk
  Сценарий: регистрация через вконтакте
    Допустим я являюсь гостем
    Если я перехожу по ссылке "Регистрация через Вконтакте"
    То пользователь с именем "Дмитрий Боровиков" и аккаунтом "vkontakte" должен быть создан
  
  @signup-id
  Сценарий: анонимная регистрация
    Допустим я являюсь гостем
    Если я перехожу по ссылке "Вход/регистрация"
    И я перехожу по ссылке "Анонимная регистрация"
    И ввожу в поле "name" значение "sour"
    И ввожу в поле "password" значение "123456"
    И ввожу в поле "password_confirmation" значение "123456"
    И нажимаю на кнопку "Регистрация"
    То пользователь с именем "sour" и аккаунтом "identity" должен быть создан
    Если я перехожу по ссылке "Выйти"
    То я должен оказаться на странице "Приветствую, гость"
    Если я перехожу по ссылке "Вход/регистрация"
    И ввожу в поле "auth_key" значение "sour"
    И ввожу в поле "password" значение "123456"
    И нажимаю на кнопку "Вход"
    То я должен оказаться на странице "Приветствую, sour"
